Museum/Documents/Инвентаризация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Инвентаризация</Name>
			<Comment>+</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Составитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Экспонаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Экспонаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Местоположение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Залы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЭкспонатов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Museum/Documents/Инвентаризация/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Инвентаризация.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Инвентаризация.Дата КАК Дата,
	|	Инвентаризация.КонецПериода КАК КонецПериода,
	|	Инвентаризация.НачалоПериода КАК НачалоПериода,
	|	Инвентаризация.Номер КАК Номер,
	|	Инвентаризация.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	Инвентаризация.Экспонаты.(
	|		НомерСтроки КАК НомерСтроки,
	|		Наименование КАК Наименование,
	|		Идентификатор КАК Идентификатор,
	|		Местоположение КАК Местоположение,
	|		Статус КАК Статус
	|	) КАК Экспонаты,
	|	Инвентаризация.Составитель КАК Составитель
	|ИЗ
	|	Документ.Инвентаризация КАК Инвентаризация
	|ГДЕ
	|	Инвентаризация.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заглавие");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьКомпьютернаяТехникаШапка = Макет.ПолучитьОбласть("КомпьютернаяТехникаШапка");
	ОбластьКомпьютернаяТехника = Макет.ПолучитьОбласть("Экспонаты");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.Номер = Выборка.Номер;
		ДатаДок = Выборка.Дата;
		ОбластьЗаголовок.Параметры.Дата = "от " + " """ + День(ДатаДок) + """   " +
		Формат(ДатаДок, "ДФ=ММММ") + "  20" + Формат(ДатаДок,"ДФ=г") + "  г.";
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Пользователь = Выборка.Составитель;
		Шапка.Параметры.НачалоПериода = Формат(Выборка.НачалоПериода, "ДЛФ=Д") + "  по";
		Шапка.Параметры.КонецПериода = Формат(Выборка.КонецПериода, "ДЛФ=Д");
		Шапка.Параметры.ОтветственноеЛицо = "" + Выборка.ОтветственноеЛицо + ".";
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьКомпьютернаяТехникаШапка);
		ВыборкаКомпьютернаяТехника = Выборка.КомпьютернаяТехника.Выбрать();
		Пока ВыборкаКомпьютернаяТехника.Следующий() Цикл
			ОбластьКомпьютернаяТехника.Параметры.Заполнить(ВыборкаКомпьютернаяТехника);
			ТабДок.Вывести(ОбластьКомпьютернаяТехника, ВыборкаКомпьютернаяТехника.Уровень());
		КонецЦикла;
		
		ТабДок.Вывести(Подвал, Выборка.Уровень());
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
